fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаВыплаты</name>
    <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type><types>String</types><stringQualifiers/></type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <registerType>Balances</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	Если НЕ ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// ВКМ_Изменение_Начало
	ДоступныйОстаток = ВКМ_ПолучитьОстатокВзаиморасчетов(ВКМ_Сотрудник, Дата);

	Если НЕ ЗначениеЗаполнено(ВКМ_СуммаВыплаты) Или ВКМ_СуммаВыплаты <= 0 Тогда
		ВКМ_СуммаВыплаты = ДоступныйОстаток;
	КонецЕсли;

	Если ВКМ_СуммаВыплаты <= 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Нет задолженности перед сотрудником для выплаты.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ВКМ_ЗаблокироватьВзаиморасчетыПоСотруднику(ВКМ_Сотрудник);
	ДоступныйОстаток = ВКМ_ПолучитьОстатокВзаиморасчетов(ВКМ_Сотрудник, Дата);

	Если ВКМ_СуммаВыплаты > ДоступныйОстаток Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма выплаты превышает остаток взаиморасчетов с сотрудником.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// ВКМ_Изменение_Конец

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Сотрудник;
	Движение.ВКМ_Сумма = ВКМ_СуммаВыплаты;

КонецПроцедуры

Функция ВКМ_ПолучитьОстатокВзаиморасчетов(Сотрудник, ДатаДокумента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Взаиморасчеты.ВКМ_СуммаОстаток, 0) КАК ВКМ_СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента, ВКМ_Сотрудник = &Сотрудник) КАК Взаиморасчеты";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВКМ_СуммаОстаток;
	КонецЕсли;

	Возврат 0;

КонецФункции

Процедура ВКМ_ЗаблокироватьВзаиморасчетыПоСотруднику(Сотрудник)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ВКМ_Сотрудник", Сотрудник);
	Блокировка.Заблокировать();

КонецПроцедуры

#КонецЕсли
